# -*- coding: utf-8 -*-
# -*- mode: org -*-
#+startup: beamer overview indent
#+LANGUAGE: pt-br
#+TAGS: noexport(n)
#+EXPORT_EXCLUDE_TAGS: noexport
#+EXPORT_SELECT_TAGS: export

#+Title: *Performance analysis*
#+Subtitle: Step II
#+Author: Francisco Pegoraro Etcheverria, Pedro Henrique Boniatti Colle, Vinícius Daniel Spadotto
#+Date: \today

#+LaTeX_CLASS: beamer
#+LaTeX_CLASS_OPTIONS: [xcolor=dvipsnames,10pt]
#+OPTIONS: H:1 num:t toc:nil \n:nil @:t ::t |:t ^:t -:t f:t *:t <:t
#+LATEX_HEADER: \input{../../lib/org-babel.tex}

* Results

Here are some results taken from the outputs of the experiments.

This is the data that will be fed to the charts.

#+begin_src R :results value :exports results :session :colnames yes
  library(tidyverse)
  library(janitor)
  library(here)

  experiments <- read.csv(here::here("phases/2/cpu.csv"))

  read_row_data <- function(Size, Iterations, Threads, Blocks) {
    dir_path <- here::here(paste0("phases/2/experiments", "/", Size, "/", Iterations, "/", Threads))
    stdout_path <- paste0(dir_path, "/.", Blocks, ".out")
    stdout_lines <- readLines(stdout_path)
    render_line <- grep("Execution time", stdout_lines, value = TRUE)
    time_str <- str_extract(render_line, "^Execution time \\(s\\) is ([0-9.]+)$", group = 1)
    time_numeric <- as.numeric(time_str)
    render_line <- grep("MSamples/s", stdout_lines, value = TRUE)
    msamples_str <- str_extract(render_line, "^MSamples/s ([0-9.]+)$", group = 1)
    msamples_numeric <- as.numeric(msamples_str)

    tibble(
      metric = c("msamples", "time"),
      value = c(msamples_numeric, time_numeric)
    )
  }

  results <- experiments |>
                  mutate(`Blocks` = substring(Blocks, 3)) %>%
  		mutate(results = pmap(., read_row_data)) |>
  		unnest(results)

  results <- clean_names(results)
                  
  results |>
    slice_head(n = 12) |>
    mutate(value = round(value, digits = 3))
#+end_src

#+RESULTS:
| size | iterations | threads | blocks | metric   |    value |
|------+------------+---------+--------+----------+----------|
|  250 |         30 |       8 |      1 | msamples |       24 |
|  250 |         30 |       8 |      1 | time     |   33.502 |
|  250 |        300 |       1 |      1 | msamples |        4 |
|  250 |        300 |       1 |      1 | time     | 2120.626 |
|  100 |        300 |       2 |      1 | msamples |        5 |
|  100 |        300 |       2 |      1 | time     |  108.425 |
|  100 |         30 |       1 |      1 | msamples |        3 |
|  100 |         30 |       1 |      1 | time     |   20.439 |
|  250 |         30 |       1 |      1 | msamples |        4 |
|  250 |         30 |       1 |      1 | time     |  209.556 |
|  100 |        300 |       4 |      1 | msamples |        9 |
|  100 |        300 |       4 |      1 | time     |   54.818 |

